knowledge_compiler/phase2/execution_layer/templates/openfoam/BENCH-04/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform ({{U_INF}} 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ({{U_INF}} 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            symmetryPlane;
    }

    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}
