knowledge_compiler/phase2/execution_layer/templates/openfoam/BENCH-04/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// Structured surrogate mesh for BENCH-04.
// The central obstacle patch is named "cylinder" for downstream solver wiring.
// Reference values: D={{D}}, Re={{REYNUMBER}}, St_ref={{STROUHAL}}

vertices
(
    ({{X_MIN}} {{Y_MIN}} 0)
    ({{X_BODY_MIN}} {{Y_MIN}} 0)
    ({{X_BODY_MAX}} {{Y_MIN}} 0)
    ({{X_MAX}} {{Y_MIN}} 0)
    ({{X_MIN}} {{Y_BODY_MIN}} 0)
    ({{X_BODY_MIN}} {{Y_BODY_MIN}} 0)
    ({{X_BODY_MAX}} {{Y_BODY_MIN}} 0)
    ({{X_MAX}} {{Y_BODY_MIN}} 0)
    ({{X_MIN}} {{Y_BODY_MAX}} 0)
    ({{X_BODY_MIN}} {{Y_BODY_MAX}} 0)
    ({{X_BODY_MAX}} {{Y_BODY_MAX}} 0)
    ({{X_MAX}} {{Y_BODY_MAX}} 0)
    ({{X_MIN}} {{Y_MAX}} 0)
    ({{X_BODY_MIN}} {{Y_MAX}} 0)
    ({{X_BODY_MAX}} {{Y_MAX}} 0)
    ({{X_MAX}} {{Y_MAX}} 0)
    ({{X_MIN}} {{Y_MIN}} {{THICKNESS}})
    ({{X_BODY_MIN}} {{Y_MIN}} {{THICKNESS}})
    ({{X_BODY_MAX}} {{Y_MIN}} {{THICKNESS}})
    ({{X_MAX}} {{Y_MIN}} {{THICKNESS}})
    ({{X_MIN}} {{Y_BODY_MIN}} {{THICKNESS}})
    ({{X_BODY_MIN}} {{Y_BODY_MIN}} {{THICKNESS}})
    ({{X_BODY_MAX}} {{Y_BODY_MIN}} {{THICKNESS}})
    ({{X_MAX}} {{Y_BODY_MIN}} {{THICKNESS}})
    ({{X_MIN}} {{Y_BODY_MAX}} {{THICKNESS}})
    ({{X_BODY_MIN}} {{Y_BODY_MAX}} {{THICKNESS}})
    ({{X_BODY_MAX}} {{Y_BODY_MAX}} {{THICKNESS}})
    ({{X_MAX}} {{Y_BODY_MAX}} {{THICKNESS}})
    ({{X_MIN}} {{Y_MAX}} {{THICKNESS}})
    ({{X_BODY_MIN}} {{Y_MAX}} {{THICKNESS}})
    ({{X_BODY_MAX}} {{Y_MAX}} {{THICKNESS}})
    ({{X_MAX}} {{Y_MAX}} {{THICKNESS}})
);

blocks
(
    hex (0 1 5 4 16 17 21 20) ({{NX_LEFT}} {{NY_OUTER}} 1) simpleGrading (1 1 1)
    hex (1 2 6 5 17 18 22 21) ({{NX_BODY}} {{NY_OUTER}} 1) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) ({{NX_RIGHT}} {{NY_OUTER}} 1) simpleGrading (1 1 1)
    hex (4 5 9 8 20 21 25 24) ({{NX_LEFT}} {{NY_BODY}} 1) simpleGrading (1 1 1)
    hex (6 7 11 10 22 23 27 26) ({{NX_RIGHT}} {{NY_BODY}} 1) simpleGrading (1 1 1)
    hex (8 9 13 12 24 25 29 28) ({{NX_LEFT}} {{NY_OUTER}} 1) simpleGrading (1 1 1)
    hex (9 10 14 13 25 26 30 29) ({{NX_BODY}} {{NY_OUTER}} 1) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) ({{NX_RIGHT}} {{NY_OUTER}} 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 20 16)
            (4 8 24 20)
            (8 12 28 24)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 7 23 19)
            (7 11 27 23)
            (11 15 31 27)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
        );
    }

    cylinder
    {
        type wall;
        faces
        (
            (5 6 22 21)
            (5 9 25 21)
            (6 10 26 22)
            (9 10 26 25)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (16 17 21 20)
            (1 5 6 2)
            (17 18 22 21)
            (2 6 7 3)
            (18 19 23 22)
            (4 8 9 5)
            (20 21 25 24)
            (6 10 11 7)
            (22 23 27 26)
            (8 12 13 9)
            (24 25 29 28)
            (9 13 14 10)
            (25 26 30 29)
            (10 14 15 11)
            (26 27 31 30)
        );
    }
);

mergePatchPairs
(
);
