knowledge_compiler/phase2/execution_layer/templates/openfoam/BENCH-04/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     {{APPLICATION}};

// Phase 7 preset: BENCH-04 cylinder wake surrogate, Re={{REYNUMBER}}, St_ref={{STROUHAL}}
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         {{END_TIME}};
deltaT          {{DELTA_T}};

writeControl    runTime;
writeInterval   {{WRITE_INTERVAL}};
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;
runTimeModifiable yes;

// pimpleFoam controls
maxCo           {{MAX_CO}};
maxDeltaT       {{MAX_DELTA_T}};
